mattehicks/SCDE/components/ESP32_I2C_Master_Module/bu/ESP32_I2C_Master_Modulexxxx.c
  I2C[i2c_num]->fifo_conf.rx_fifo_rst = 1;

  I2C[i2c_num]->fifo_conf.rx_fifo_rst = 0;

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;

}













esp_err_t i2c_set_pin(i2c_port_t i2c_num, gpio_num_t sda_io_num, gpio_num_t scl_io_num, gpio_pullup_t sda_pullup_en, gpio_pullup_t scl_pullup_en, i2c_mode_t mode)
{
    I2C_CHECK(( i2c_num < I2C_NUM_MAX ), I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
    I2C_CHECK(((GPIO_IS_VALID_OUTPUT_GPIO(sda_io_num))), I2C_SDA_IO_ERR_STR, ESP_ERR_INVALID_ARG);
    I2C_CHECK((GPIO_IS_VALID_OUTPUT_GPIO(scl_io_num)) ||
              (GPIO_IS_VALID_GPIO(scl_io_num) && mode == I2C_MODE_SLAVE),
              I2C_SCL_IO_ERR_STR,
              ESP_ERR_INVALID_ARG);
    I2C_CHECK((sda_pullup_en == GPIO_PULLUP_ENABLE && GPIO_IS_VALID_OUTPUT_GPIO(sda_io_num)) ||
               sda_pullup_en == GPIO_PULLUP_DISABLE, I2C_GPIO_PULLUP_ERR_STR, ESP_ERR_INVALID_ARG);
    I2C_CHECK((scl_pullup_en == GPIO_PULLUP_ENABLE && GPIO_IS_VALID_OUTPUT_GPIO(scl_io_num)) ||
               scl_pullup_en == GPIO_PULLUP_DISABLE, I2C_GPIO_PULLUP_ERR_STR, ESP_ERR_INVALID_ARG);

    int sda_in_sig, sda_out_sig, scl_in_sig, scl_out_sig;
    switch (i2c_num) {
        case I2C_NUM_1:
            sda_out_sig = I2CEXT1_SDA_OUT_IDX;
            sda_in_sig = I2CEXT1_SDA_IN_IDX;
            scl_out_sig = I2CEXT1_SCL_OUT_IDX;
            scl_in_sig = I2CEXT1_SCL_IN_IDX;
            break;
        case I2C_NUM_0:
            default:
            sda_out_sig = I2CEXT0_SDA_OUT_IDX;
            sda_in_sig = I2CEXT0_SDA_IN_IDX;
            scl_out_sig = I2CEXT0_SCL_OUT_IDX;
            scl_in_sig = I2CEXT0_SCL_IN_IDX;
            break;
    }
    if (sda_io_num >= 0) {
        gpio_set_level(sda_io_num, I2C_IO_INIT_LEVEL);
        PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[sda_io_num], PIN_FUNC_GPIO);
        gpio_set_direction(sda_io_num, GPIO_MODE_INPUT_OUTPUT_OD);
        if (sda_pullup_en == GPIO_PULLUP_ENABLE) {
            gpio_set_pull_mode(sda_io_num, GPIO_PULLUP_ONLY);
        } else {
            gpio_set_pull_mode(sda_io_num, GPIO_FLOATING);
        }
        gpio_matrix_out(sda_io_num, sda_out_sig, 0, 0);
        gpio_matrix_in(sda_io_num, sda_in_sig, 0);
    }

    if (scl_io_num >= 0) {
        gpio_set_level(scl_io_num, I2C_IO_INIT_LEVEL);
        PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[scl_io_num], PIN_FUNC_GPIO);
        if (mode == I2C_MODE_MASTER) {
            gpio_set_direction(scl_io_num, GPIO_MODE_INPUT_OUTPUT_OD);
            gpio_matrix_out(scl_io_num, scl_out_sig, 0, 0);
        } else {
            gpio_set_direction(scl_io_num, GPIO_MODE_INPUT);
        }
        if (scl_pullup_en == GPIO_PULLUP_ENABLE) {
            gpio_set_pull_mode(scl_io_num, GPIO_PULLUP_ONLY);
        } else {
            gpio_set_pull_mode(scl_io_num, GPIO_FLOATING);
        }
        gpio_matrix_in(scl_io_num, scl_in_sig, 0);
    }
    return ESP_OK;
}













/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_cmd_link_create
 *  Desc: 
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
i2c_cmd_handle_t i2c_cmd_link_create()
{
  i2c_cmd_desc_t* cmd_desc = (i2c_cmd_desc_t*) calloc(1, sizeof(i2c_cmd_desc_t));
  return (i2c_cmd_handle_t) cmd_desc;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_cmd_link_delete
 *  Desc: 
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
void i2c_cmd_link_delete(i2c_cmd_handle_t cmd_handle)
{

  if (cmd_handle == NULL) {

    return;

  }

  i2c_cmd_desc_t* cmd = (i2c_cmd_desc_t*) cmd_handle;

  while (cmd->free) {

    i2c_cmd_link_t* ptmp = cmd->free;

    cmd->free = cmd->free->next;

    free(ptmp);

  }

  cmd->cur = NULL;
  cmd->free = NULL;
  cmd->head = NULL;

  free(cmd_handle);

  return;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_cmd_link_append
 *  Desc: 
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
static esp_err_t i2c_cmd_link_append(i2c_cmd_handle_t cmd_handle, i2c_cmd_t* cmd)
{
  i2c_cmd_desc_t* cmd_desc = (i2c_cmd_desc_t*) cmd_handle;

  if (cmd_desc->head == NULL) {

    cmd_desc->head = (i2c_cmd_link_t*) malloc(sizeof(i2c_cmd_link_t));

    if (cmd_desc->head == NULL) {

      ESP_LOGE(I2C_TAG, I2C_CMD_MALLOC_ERR_STR);

      goto err;

    }

    cmd_desc->cur = cmd_desc->head;
    cmd_desc->free = cmd_desc->head;

  } else {

    cmd_desc->cur->next = (i2c_cmd_link_t*) malloc(sizeof(i2c_cmd_link_t));

    if (cmd_desc->cur->next == NULL) {

      ESP_LOGE(I2C_TAG, I2C_CMD_MALLOC_ERR_STR);

      goto err;

    }

    cmd_desc->cur = cmd_desc->cur->next;

  }

  memcpy((uint8_t*) &cmd_desc->cur->cmd, (uint8_t*) cmd, sizeof(i2c_cmd_t));

  cmd_desc->cur->next = NULL;

  return ESP_OK;

  err:

  return ESP_FAIL;

}



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_master_start
 *  Desc: 
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t i2c_master_start(i2c_cmd_handle_t cmd_handle)
{

  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);

  i2c_cmd_t cmd;

  cmd.ack_en = 0;
  cmd.ack_exp = 0;
  cmd.ack_val = 0;
  cmd.byte_num = 0;
  cmd.data = NULL;
  cmd.op_code = I2C_CMD_RESTART;

  return i2c_cmd_link_append(cmd_handle, &cmd);

}



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_master_stop
 *  Desc: 
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t i2c_master_stop(i2c_cmd_handle_t cmd_handle)
{

  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);

  i2c_cmd_t cmd;

  cmd.ack_en = 0;
  cmd.ack_exp = 0;
  cmd.ack_val = 0;
  cmd.byte_num = 0;
  cmd.data = NULL;
  cmd.op_code = I2C_CMD_STOP;

  return i2c_cmd_link_append(cmd_handle, &cmd);

