mattehicks/SCDE/components/ESP32_I2C_Master_Module/bu/ESP32_I2C_Master_Modulexxxx.c
}


/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_master_write
 *  Desc: 
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t i2c_master_write(i2c_cmd_handle_t cmd_handle, uint8_t* data, size_t data_len, bool ack_en)
{

  I2C_CHECK((data != NULL), I2C_ADDR_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);

  uint8_t len_tmp;
  int data_offset = 0;

  esp_err_t ret;

  while (data_len > 0) {

    len_tmp = data_len > 0xff ? 0xff : data_len;
    data_len -= len_tmp;

    i2c_cmd_t cmd;

    cmd.ack_en = ack_en;
    cmd.ack_exp = 0;
    cmd.ack_val = 0;
    cmd.byte_num = len_tmp;
    cmd.op_code = I2C_CMD_WRITE;
    cmd.data = data + data_offset;

    ret = i2c_cmd_link_append(cmd_handle, &cmd);

    data_offset += len_tmp;

    if (ret != ESP_OK) {

      return ret;

    }
  }

  return ESP_OK;

}



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_master_write_byte
 *  Desc: 
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t i2c_master_write_byte(i2c_cmd_handle_t cmd_handle, uint8_t data, bool ack_en)
{

  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);

  i2c_cmd_t cmd;

  cmd.ack_en = ack_en;
  cmd.ack_exp = 0;
  cmd.ack_val = 0;
  cmd.byte_num = 1;
  cmd.op_code = I2C_CMD_WRITE;
  cmd.data = NULL;
  cmd.byte_cmd = data;

  return i2c_cmd_link_append(cmd_handle, &cmd);

}



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_master_read
 *  Desc: 
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t i2c_master_read(i2c_cmd_handle_t cmd_handle, uint8_t* data, size_t data_len, int ack)
{
  I2C_CHECK((data != NULL), I2C_ADDR_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);

  int len_tmp;
  int data_offset = 0;
  esp_err_t ret;

  while (data_len > 0) {

    len_tmp = data_len > 0xff ? 0xff : data_len;
    data_len -= len_tmp;

    i2c_cmd_t cmd;

    cmd.ack_en = 0;
    cmd.ack_exp = 0;
    cmd.ack_val = ack & 0x1;
    cmd.byte_num = len_tmp;
    cmd.op_code = I2C_CMD_READ;
    cmd.data = data + data_offset;

    ret = i2c_cmd_link_append(cmd_handle, &cmd);

    data_offset += len_tmp;

    if (ret != ESP_OK) {

      return ret;

    }
  }

  return ESP_OK;

}



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_master_read_byte
 *  Desc: 
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t i2c_master_read_byte(i2c_cmd_handle_t cmd_handle, uint8_t* data, int ack)
{
  I2C_CHECK((data != NULL), I2C_ADDR_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);

  i2c_cmd_t cmd;

  cmd.ack_en = 0;
  cmd.ack_exp = 0;
  cmd.ack_val = ack & 0x1;
  cmd.byte_num = 1;
  cmd.op_code = I2C_CMD_READ;
  cmd.data = data;

  return i2c_cmd_link_append(cmd_handle, &cmd);

}



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_master_cmd_begin_static
 *  Desc: 
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
static void IRAM_ATTR i2c_master_cmd_begin_static(i2c_obj_t* p_i2c) //i2c_port_t i2c_num)
{

//  i2c_obj_t* p_i2c = p_i2c_obj[i2c_num];
  int i2c_num = p_i2c->i2c_num;

  portBASE_TYPE HPTaskAwoken = pdFALSE;

  //This should never happen
  if (p_i2c->mode == I2C_MODE_SLAVE) {

        return;

  }

  if (p_i2c->status == I2C_STATUS_DONE) {

    return;

  } else if (p_i2c->status == I2C_STATUS_ACK_ERROR) {

    I2C[i2c_num]->int_ena.end_detect = 0;
    I2C[i2c_num]->int_clr.end_detect = 1;
    I2C[i2c_num]->int_ena.master_tran_comp = 0;
    xSemaphoreGiveFromISR(p_i2c->cmd_sem, &HPTaskAwoken);

    if (HPTaskAwoken == pdTRUE) {

      portYIELD_FROM_ISR();

    }

    return;

  } else if (p_i2c->status == I2C_STATUS_READ) {

    i2c_cmd_t *cmd = &p_i2c->cmd_link.head->cmd;

    while (p_i2c->rx_cnt-- > 0) {

      *cmd->data++ = READ_PERI_REG(I2C_DATA_APB_REG(i2c_num));

    }

    if (cmd->byte_num > 0) {

      p_i2c->rx_fifo_remain = I2C_FIFO_LEN;

      p_i2c->cmd_idx = 0;

    } else {

      p_i2c->cmd_link.head = p_i2c->cmd_link.head->next;

    }

  }

  if (p_i2c->cmd_link.head == NULL) {

    p_i2c->cmd_link.cur = NULL;

    xSemaphoreGiveFromISR(p_i2c->cmd_sem, &HPTaskAwoken);

    if (HPTaskAwoken == pdTRUE) {

      portYIELD_FROM_ISR();

    }

    return;

  }

  while (p_i2c->cmd_link.head) {

    i2c_cmd_t *cmd = &p_i2c->cmd_link.head->cmd;

    I2C[i2c_num]->command[p_i2c->cmd_idx].val = 0;
    I2C[i2c_num]->command[p_i2c->cmd_idx].ack_en = cmd->ack_en;
    I2C[i2c_num]->command[p_i2c->cmd_idx].ack_exp = cmd->ack_exp;
    I2C[i2c_num]->command[p_i2c->cmd_idx].ack_val = cmd->ack_val;
    I2C[i2c_num]->command[p_i2c->cmd_idx].byte_num = cmd->byte_num;
    I2C[i2c_num]->command[p_i2c->cmd_idx].op_code = cmd->op_code;

    if (cmd->op_code == I2C_CMD_WRITE) {

      uint32_t wr_filled = 0;

      //TODO: to reduce interrupt number
      if (cmd->data) {

        while (p_i2c->tx_fifo_remain > 0 && cmd->byte_num > 0) {

          WRITE_PERI_REG(I2C_DATA_APB_REG(i2c_num), *cmd->data++);
          p_i2c->tx_fifo_remain--;
          cmd->byte_num--;
          wr_filled++;

