mattehicks/SCDE/components/ESP32_I2C_Master_Module/bu/ESP32_I2C_Master_Modulexxxx.c
        }

      } else {

        WRITE_PERI_REG(I2C_DATA_APB_REG(i2c_num), cmd->byte_cmd);
        p_i2c->tx_fifo_remain--;
        cmd->byte_num--;
        wr_filled ++;

      }

      // Workaround for register field operation.
      I2C[i2c_num]->command[p_i2c->cmd_idx].byte_num = wr_filled;
      I2C[i2c_num]->command[p_i2c->cmd_idx + 1].val = 0;
      I2C[i2c_num]->command[p_i2c->cmd_idx + 1].op_code = I2C_CMD_END;
      p_i2c->tx_fifo_remain = I2C_FIFO_LEN;
      p_i2c->cmd_idx = 0;

      if (cmd->byte_num > 0) {

      } else {

        p_i2c->cmd_link.head = p_i2c->cmd_link.head->next;

      }

      p_i2c->status = I2C_STATUS_WRITE;

      break;

    } else if(cmd->op_code == I2C_CMD_READ) {

      //TODO: to reduce interrupt number
      p_i2c->rx_cnt = cmd->byte_num > p_i2c->rx_fifo_remain ? p_i2c->rx_fifo_remain : cmd->byte_num;

      cmd->byte_num -= p_i2c->rx_cnt;

      I2C[i2c_num]->command[p_i2c->cmd_idx].byte_num = p_i2c->rx_cnt;
      I2C[i2c_num]->command[p_i2c->cmd_idx].ack_val = cmd->ack_val;
      I2C[i2c_num]->command[p_i2c->cmd_idx + 1].val = 0;
      I2C[i2c_num]->command[p_i2c->cmd_idx + 1].op_code = I2C_CMD_END;

      p_i2c->status = I2C_STATUS_READ;

      break;

    } else {

    }

    p_i2c->cmd_idx++;
    p_i2c->cmd_link.head = p_i2c->cmd_link.head->next;

    if (p_i2c->cmd_link.head == NULL || p_i2c->cmd_idx >= 15) {

      p_i2c->tx_fifo_remain = I2C_FIFO_LEN;
      p_i2c->cmd_idx = 0;
      p_i2c->status = I2C_STATUS_IDLE;

      break;

    }
  }

  I2C[i2c_num]->int_clr.end_detect = 1;
  I2C[i2c_num]->int_clr.master_tran_comp = 1;
  I2C[i2c_num]->int_ena.end_detect = 1;
  I2C[i2c_num]->int_ena.master_tran_comp = 1;
  I2C[i2c_num]->ctr.trans_start = 0;
  I2C[i2c_num]->ctr.trans_start = 1;

  return;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_master_cmd_begin
 *  Desc: 
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
//esp_err_t i2c_master_cmd_begin(i2c_port_t i2c_num, i2c_cmd_handle_t cmd_handle, portBASE_TYPE ticks_to_wait)
esp_err_t i2c_master_cmd_begin(i2c_obj_t* p_i2c, i2c_cmd_handle_t cmd_handle, portBASE_TYPE ticks_to_wait)
{

  int i2c_num = p_i2c->i2c_num;

  I2C_CHECK(( i2c_num < I2C_NUM_MAX ), I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(p_i2c != NULL, I2C_DRIVER_NOT_INSTALL_ERR_STR, ESP_ERR_INVALID_STATE);
  I2C_CHECK(p_i2c->mode == I2C_MODE_MASTER, I2C_MASTER_MODE_ERR_STR, ESP_ERR_INVALID_STATE);
  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);

  esp_err_t ret;

 //   i2c_obj_t* p_i2c = p_i2c_obj[i2c_num];

  portTickType ticks_end = xTaskGetTickCount() + ticks_to_wait;
  portBASE_TYPE res = xSemaphoreTake(p_i2c->cmd_mux, ticks_to_wait);
  if (res == pdFALSE) {

    return ESP_ERR_TIMEOUT;
  }

    xSemaphoreTake(p_i2c->cmd_sem, 0);
    i2c_reset_tx_fifo(i2c_num);
    i2c_reset_rx_fifo(i2c_num);
    i2c_cmd_desc_t* cmd = (i2c_cmd_desc_t*) cmd_handle;
    p_i2c->cmd_link.free = cmd->free;
    p_i2c->cmd_link.cur = cmd->cur;
    p_i2c->cmd_link.head = cmd->head;
    p_i2c->status = I2C_STATUS_IDLE;
    p_i2c->cmd_idx = 0;
    p_i2c->rx_cnt = 0;
    p_i2c->tx_fifo_remain = I2C_FIFO_LEN;
    p_i2c->rx_fifo_remain = I2C_FIFO_LEN;
    i2c_reset_tx_fifo(i2c_num);
    i2c_reset_rx_fifo(i2c_num);

    //start send commands, at most 32 bytes one time, isr handler will process the remaining commands.
    i2c_master_cmd_begin_static(p_i2c);
    ticks_to_wait = ticks_end - xTaskGetTickCount();
    res = xSemaphoreTake(p_i2c->cmd_sem, ticks_to_wait);
    if (res == pdFALSE) {
        ret = ESP_ERR_TIMEOUT;
    } else if (p_i2c->status == I2C_STATUS_ACK_ERROR) {
        ret = ESP_FAIL;
    } else {
        ret = ESP_OK;
    }
    p_i2c->status = I2C_STATUS_DONE;
    xSemaphoreGive(p_i2c->cmd_mux);
    return ret;
}


